In [1]:
import sqlhelpers as sh

In [2]:
# %load Exercise Files\\Chapters\\sql-chap06.txt

# Numeric Types

In [3]:
# comparing float types can produce unexpected behaviour.
q = """
SELECT A, B, A = B FROM 
  ( SELECT 
    ( ( .1 + .2 ) * 10 ) as A,
    ( 1.0 + 2.0 ) as B
  );
"""
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: |||
SELECT A, B, A = B FROM
  ( SELECT
    ( ( .1 + .2 ) * 10 ) as A,
    ( 1.0 + 2.0 ) as B
  );
 |||

There are 1 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
     A    B  A = B
0  3.0  3.0      0

# What type is that value

In [4]:
q = "SELECT TYPEOF( 1 + 1 );"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT TYPEOF( 1 + 1 ); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
  TYPEOF( 1 + 1 )
0         integer

In [5]:
q = "SELECT TYPEOF( 1 + 1.0 );"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT TYPEOF( 1 + 1.0 ); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
  TYPEOF( 1 + 1.0 )
0              real

In [8]:
q = "SELECT TYPEOF('panda');"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT TYPEOF('panda'); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
  TYPEOF('panda')
0            text

In [9]:
q = "SELECT TYPEOF('panda' + 'koala');"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT TYPEOF('panda' + 'koala'); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
  TYPEOF('panda' + 'koala')
0                   integer

# Integer division

In [10]:
# basic integer division
q = "SELECT 1 / 2;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 1 / 2; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   1 / 2
0      0

In [11]:
# to get the decimal place one of the numbers needs to be a real number

q1 = "SELECT 1.0 / 2;"
sh.query_result_stats(q1, "world.db")

# or

q2 = "SELECT CAST(1 AS REAL) / 2;"
sh.query_result_stats(q2, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 1.0 / 2; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   1.0 / 2
0      0.5
### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT CAST(1 AS REAL) / 2; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   CAST(1 AS REAL) / 2
0                  0.5

In [12]:
# the remainder can be gotten from a division using a modulo function

q1 = "SELECT 17 / 5;"
sh.query_result_stats(q1, "world.db")

# or

q2 = "SELECT 17 / 5, 17 % 5;"
sh.query_result_stats(q2, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 17 / 5; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   17 / 5
0       3
### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 17 / 5, 17 % 5; |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
   17 / 5  17 % 5
0       3       2

# Rounding numbers

In [ ]:
SELECT 2.55555;
SELECT ROUND(2.55555);
SELECT ROUND(2.55555, 3);
SELECT ROUND(2.55555, 0);

In [14]:
# test the precision
q = "SELECT 2.55555;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT 2.55555; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   2.55555
0  2.55555

In [15]:
# round to the nearest whole number
q = "SELECT ROUND(2.55555);"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT ROUND(2.55555); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   ROUND(2.55555)
0             3.0

In [16]:
# round to 3 decimal places
q = "SELECT ROUND(2.55555, 3);"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT ROUND(2.55555, 3); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   ROUND(2.55555, 3)
0              2.556

In [17]:
# round to 0 decimal places
q = "SELECT ROUND(2.55555, 0);"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT ROUND(2.55555, 0); |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   ROUND(2.55555, 0)
0                3.0